Revit 2024 API
BuiltInFailures.GeneralFailures.CannotFixProblem Property
 Failed to fix problem. Action has to be cancelled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotFixProblem { get; }
Visual Basic
Public Shared ReadOnly Property CannotFixProblem As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotFixProblem {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace